// Задача 10: Напишите программу, которая принимает на вход трёхзначное число 
// и на выходе показывает вторую цифру этого числа.

// Console.Clear();
// Console.Write("Введите трехзначное число: ");
// int a = Convert.ToInt32(Console.ReadLine());
// string list = Convert.ToString(a);

// Console.WriteLine(list[1]);



// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает,
// что третьей цифры нет.

// Console.Clear();
// Console.Write("Введите число: ");
// int a = Convert.ToInt32(Console.ReadLine());
// string list = Convert.ToString(a);
// int b = 123;
// string c = Convert.ToString(b);

// if (a >= b)
// {
//     Console.WriteLine("Третья цифра заданного числа" + " " + list[2]);
// }
// else
// {
//     Console.WriteLine("Третьей цифры нет");
// }


// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
// и проверяет, является ли этот день выходным.

// Console.Clear();
// Console.WriteLine("Введите день(число) недели(1-7): ");
// int a = Convert.ToInt32(Console.ReadLine());
// int count = 5;

// if (a <= count)
// {
//     Console.WriteLine("Это рабочий день");
// }
// else
// {
//     Console.WriteLine("Это выходной день");
// }